{
  "head": {
    "title": "ค้นหาในเอกสาร {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "{{ProdFullName}} เพิ่มฟังก์ชันการค้นหาข้อความที่มีประสิทธิภาพในแอปพลิเคชัน {{ProgLang}} รองรับรูปแบบเอกสารธุรกิจต่างๆ"
  },
  "header": {
    "title": "ค้นหาข้อความในเอกสารทางธุรกิจ",
    "description": "{{ProdFullName}} ช่วยให้คุณค้นหาข้อความในเอกสารด้วยคำค้นที่ยืดหยุ่นและแม่นยำ รวมเข้ากับฟังก์ชันการค้นหาในแอปพลิเคชัน {{EnvNameShort}} ได้อย่างราบรื่น",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "{{ProdShortName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีที่มีความสามารถในการค้นหาข้อความและการจัดทำดัชนีเอกสารอย่างรวดเร็ว รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ รวมถึงมาตรฐานในอุตสาหกรรมเช่น PDF, Word, Excel และ PowerPoint คุณสามารถเพิ่มความเร็วในการค้นหาที่แม่นยำให้กับแอปพลิเคชันของคุณได้"
  },
  "more_features": {
    "title": "ความสามารถในการค้นหาที่พัฒนาเพิ่มขึ้น",
    "description": "{{ProdFullName}} ให้การค้นหาข้อความขั้นสูงในมากกว่า 70 รูปแบบไฟล์ การจัดทำดัชนีช่วยเพิ่มความเร็วในการค้นหาและปรับปรุงประสิทธิภาพการจัดการเอกสาร",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความที่ทรงพลัง",
      "content": "ค้นหาข้อความในรูปแบบเอกสารที่นิยมเช่น PDFs, ไฟล์ Word, งานนำเสนอ และสเปรดชีต รองรับวิธีการค้นหาหลายแบบรวมถึงการค้นหาแบบไม่สมบูรณ์, คำพ้องเสียง, และอักขระตัวแทน"
    },
    "feature_2": {
      "title": "การจัดทำดัชนีที่ปรับให้เหมาะสมเพื่อประสิทธิภาพที่ดียิ่งขึ้น",
      "content": "สร้างและนำกลับมาใช้ใหม่ในการจัดทำดัชนีการค้นหาเพื่อเพิ่มความเร็วและประสิทธิภาพในการค้นหา โดยเฉพาะในชุดเอกสารขนาดใหญ่"
    },
    "feature_3": {
      "title": "การสนับสนุนการค้นหาหลายภาษา",
      "content": "ค้นหาในเอกสารที่เขียนในมากกว่า 80 ภาษา โดยตรวจจับรูปแบบแป้นพิมพ์ที่แตกต่างกันและตัวแปรของคำเพื่อเพิ่มความแม่นยำ"
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาที่ปรับแต่งได้",
      "content": "จำกัดผลลัพธ์การค้นหาด้วยตัวกรอง, นิพจน์ปกติ, และการตั้งค่าการค้นหาขั้นสูงอื่นๆ"
    }
  },
  "formats": {
    "title": "ค้นหาในเอกสารทางธุรกิจ",
    "description": "{{ProdShortName}} รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ ซึ่งทำให้ค้นหาเอกสารสำนักงานที่ใช้กันอย่างแพร่หลายได้ง่าย"
  },
  "operations": {
    "title": "คุณสมบัติหลัก",
    "description": "ดำเนินการค้นหาข้อความที่แม่นยำและมีประสิทธิภาพ"
  },
  "examples": {
    "comment_1": "ไดเรกทอรีสำหรับจัดเก็บดัชนีการค้นหาที่สามารถใช้ซ้ำได้",
    "comment_2": "โฟลเดอร์ที่มีเอกสาร",
    "comment_3": "กรองการค้นหาตามรูปแบบเอกสาร",
    "comment_4": "ดึงผลลัพธ์การค้นหา"
  },
  "steps": {
    "title": "วิธีค้นหาในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้สามารถค้นหาข้อความได้อย่างรวดเร็วและมีประสิทธิภาพในเอกสาร {{FileFormatUp}} ซึ่งเหมาะสำหรับแอปพลิเคชัน {{EnvName}}",
      "step_1": "ระบุโฟลเดอร์เพื่อจัดเก็บดัชนีการค้นหา",
      "step_2": "เลือกโฟลเดอร์ที่มีเอกสารของคุณ",
      "step_3": "กำหนดค่าออปชั่นการค้นหาเพื่อจำกัดผลลัพธ์ให้อยู่ในเอกสาร {{FileFormatUp}}",
      "step_4": "ดำเนินการค้นหาและรับผลลัพธ์"
    }
  },
  "code_1": {
    "title": "กรองเอกสารก่อนการค้นหา",
    "content": "เรียนรู้วิธีการปรับแต่งการค้นหาด้วยการกรอง",
    "comment_1": "ตั้งค่าดัชนีที่ไม่รวมรูปแบบไฟล์บางรูปแบบ",
    "comment_2": "ระบุเส้นทางการเก็บเอกสาร",
    "comment_3": "ดึงผลลัพธ์การค้นหา",
    "comment_4": "ประมวลผลและใช้ผลลัพธ์การค้นหา"
  }
}