{
  "head": {
    "title": "ค้นหาในเอกสาร {{FileFormatUp}} โดยใช้ {{EnvNameShort}}",
    "description": "{{ProdFullName}} เพิ่มความสามารถในการค้นหาข้อความที่รวดเร็วและแม่นยำให้กับแอปพลิเคชัน {{ProgLang}} รองรับหลายรูปแบบเอกสาร."
  },
  "header": {
    "title": "ค้นหาข้อความในเอกสารทางธุรกิจ",
    "description": "{{ProdFullName}} มอบฟังก์ชันการค้นหาที่ทรงพลังและยืดหยุ่นสำหรับเอกสาร รวมถึงการรวมการค้นหาข้อความเข้ากับแอปพลิเคชัน {{EnvNameShort}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "อะไรคือ {{ProdShortName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีการค้นหาและการจัดทำดัชนีที่แข็งแกร่ง ช่วยให้สามารถดึงข้อมูลที่รวดเร็วในเอกสาร รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ รวมถึง PDF, Word, Excel และ PowerPoint เพื่อให้การค้นหาที่แม่นยำและมีประสิทธิภาพ."
  },
  "more_features": {
    "title": "ความสามารถการค้นหาขั้นสูง",
    "description": "{{ProdFullName}} ช่วยเพิ่มประสิทธิภาพในการค้นหาเอกสารโดยการจัดทำดัชนีรูปแบบไฟล์มากกว่า 70 รูปแบบ ปรับแต่งการเรียกคืนเนื้อหาด้วยเทคนิคการค้นหาขั้นสูง.",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความที่ครอบคลุม",
      "content": "ดึงและหาข้อความในรูปแบบเอกสารยอดนิยม เช่น PDF, ไฟล์ Word, สเปรดชีต และการนำเสนอ รองรับการค้นหาที่ไม่แน่นอน, เสียงพ้อง, และการค้นหาด้วยอักขระแทน."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีที่ปรับแต่งสำหรับประสิทธิภาพ",
      "content": "เร่งการค้นหาด้วยการสร้างดัชนีที่สามารถนำกลับมาใช้ใหม่ได้ พร้อมเพิ่มความเร็วและประสิทธิภาพเมื่อทำงานกับคอลเลกชันเอกสารขนาดใหญ่."
    },
    "feature_3": {
      "title": "การสนับสนุนหลายภาษา",
      "content": "ค้นหาเอกสารในมากกว่า 80 ภาษา เครื่องมือรับรู้รูปแบบแป้นพิมพ์และความแตกต่างของคำเพื่อความแม่นยำที่ดียิ่งขึ้น."
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาที่ปรับแต่งได้",
      "content": "ปรับแต่งผลลัพธ์การค้นหาด้วยฟิลเตอร์, การแสดงนิพจน์ปกติ, ความไวต่ออักษรตัวพิมพ์ใหญ่ และการตั้งค่าอื่น ๆ ที่ยืดหยุ่น."
    }
  },
  "formats": {
    "title": "ค้นหาในรูปแบบเอกสารที่หลากหลาย",
    "description": "{{ProdShortName}} รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ ทำให้สามารถค้นหาข้อความได้อย่างมีประสิทธิภาพในเอกสารทางธุรกิจและสำนักงานต่าง ๆ."
  },
  "operations": {
    "title": "ฟังก์ชันหลัก",
    "description": "ดำเนินการค้นหาข้อความที่รวดเร็วและแม่นยำทั่วทั้งเอกสาร."
  },
  "examples": {
    "comment_1": "กำหนดไดเรกทอรีสำหรับจัดเก็บดัชนีการค้นหา",
    "comment_2": "ระบุโฟลเดอร์ที่มีเอกสารที่ค้นหาได้",
    "comment_3": "จำกัดการค้นหาเฉพาะรูปแบบไฟล์ที่กำหนด",
    "comment_4": "ดึงและประมวลผลผลลัพธ์การค้นหา"
  },
  "steps": {
    "title": "วิธีการค้นหาในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้การค้นหาข้อความในเอกสาร {{FileFormatUp}} เป็นเรื่องง่ายและมีประสิทธิภาพสำหรับแอปพลิเคชัน {{EnvName}}.",
      "step_1": "สร้างไดเรกทอรีสำหรับจัดเก็บดัชนีการค้นหา.",
      "step_2": "เลือกโฟลเดอร์ที่มีเอกสาร.",
      "step_3": "ตั้งค่าตัวเลือกการค้นหาเพื่อรวมเฉพาะไฟล์ {{FileFormatUp}}.",
      "step_4": "ดำเนินการค้นหาและดึงผลลัพธ์."
    }
  },
  "code_1": {
    "title": "กรองเอกสารที่ค้นหาได้",
    "content": "เรียนรู้วิธีปรับปรุงการค้นหาเอกสารโดยใช้ฟิลเตอร์.",
    "comment_1": "กำหนดค่าดัชนีเพื่อลบรูปแบบไฟล์ที่ไม่ต้องการ",
    "comment_2": "ระบุไดเรกทอรีที่มีเอกสาร",
    "comment_3": "ดึงและแสดงผลลัพธ์การค้นหา",
    "comment_4": "ประมวลผลผลลัพธ์การค้นหาเพื่อใช้งานต่อไป"
  }
}