{
  "head": {
    "title": "Tìm kiếm trong tài liệu {{FileFormatUp}} sử dụng {{EnvNameShort}}",
    "description": "{{ProdFullName}} nâng cao các ứng dụng {{ProgLang}} với khả năng tìm kiếm văn bản hiệu quả qua nhiều định dạng tài liệu kinh doanh khác nhau."
  },
  "header": {
    "title": "Tìm kiếm văn bản trong tài liệu kinh doanh",
    "description": "{{ProdFullName}} cho phép tìm kiếm văn bản mạnh mẽ và linh hoạt trong tài liệu của bạn. Tích hợp chức năng tìm kiếm vào các ứng dụng {{EnvNameShort}} một cách dễ dàng.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Tải xuống miễn phí"
  },
  "about": {
    "title": "{{ProdShortName}} là gì?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) là một thư viện mạnh mẽ cho việc tìm kiếm văn bản hiệu quả và lập chỉ mục tài liệu. Nó hỗ trợ hơn 70 định dạng tệp, bao gồm các tài liệu tiêu chuẩn ngành như PDF, Word, Excel, và PowerPoint. Cải thiện hiệu suất tìm kiếm với kết quả nhanh chóng và chính xác."
  },
  "more_features": {
    "title": "Các tính năng tìm kiếm nâng cao",
    "description": "{{ProdFullName}} cho phép tìm kiếm văn bản tinh vi qua hơn 70 định dạng tệp. Việc lập chỉ mục cải thiện hiệu quả tìm kiếm và giúp quản lý nội dung tài liệu một cách hiệu quả.",
    "image_description": "Các tính năng chính của {{ProdShortName}}",
    "feature_1": {
      "title": "Tìm kiếm văn bản nâng cao",
      "content": "Trích xuất văn bản liên quan từ tài liệu kinh doanh phổ biến, bao gồm PDF, tệp Word, bài thuyết trình và bảng tính. Hỗ trợ nhiều kỹ thuật tìm kiếm như tìm kiếm mờ, phát hiện đồng âm và ký tự đại diện."
    },
    "feature_2": {
      "title": "Lập chỉ mục tối ưu cho tìm kiếm nhanh hơn",
      "content": "Xây dựng và tái sử dụng các chỉ mục tìm kiếm để tăng tốc độ tìm kiếm. Lập chỉ mục tối ưu hóa hiệu suất khi tìm kiếm qua các bộ sưu tập tài liệu lớn."
    },
    "feature_3": {
      "title": "Hỗ trợ nhiều ngôn ngữ",
      "content": "Thực hiện tìm kiếm trong các tài liệu viết bằng hơn 80 ngôn ngữ. Phát hiện các kiểu bàn phím khác nhau và biến thể từ ngữ để cải thiện độ chính xác."
    },
    "feature_4": {
      "title": "Cài đặt tìm kiếm linh hoạt",
      "content": "Tinh chỉnh kết quả tìm kiếm với các tùy chọn tùy chỉnh, bao gồm bộ lọc, biểu thức chính quy và cài đặt nhạy cảm với chữ hoa chữ thường."
    }
  },
  "formats": {
    "title": "Tìm dữ liệu trong tài liệu kinh doanh của bạn",
    "description": "{{ProdShortName}} hỗ trợ hơn 70 định dạng tệp, cho phép xử lý và tìm kiếm hiệu quả các tài liệu văn phòng phổ biến."
  },
  "operations": {
    "title": "Các tính năng chính",
    "description": "Thực hiện tìm kiếm dữ liệu chính xác và hiệu quả."
  },
  "examples": {
    "comment_1": "Đường dẫn lưu trữ chỉ mục tìm kiếm tái sử dụng",
    "comment_2": "Thư mục chứa tài liệu",
    "comment_3": "Tìm kiếm chỉ trong các định dạng tệp cụ thể",
    "comment_4": "Lấy kết quả tìm kiếm"
  },
  "steps": {
    "title": "Cách tìm kiếm trong dữ liệu {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) cho phép tìm kiếm văn bản hiệu quả trong tài liệu {{FileFormatUp}}, lý tưởng cho các ứng dụng {{EnvName}}.",
      "step_1": "Thiết lập thư mục để lưu trữ chỉ mục tìm kiếm.",
      "step_2": "Chọn thư mục chứa các tệp của bạn.",
      "step_3": "Cấu hình các tùy chọn tìm kiếm để chỉ xử lý các tài liệu {{FileFormatUp}}.",
      "step_4": "Thực hiện tìm kiếm và lấy kết quả."
    }
  },
  "code_1": {
    "title": "Lọc tài liệu cần được xử lý",
    "content": "Tìm hiểu cách thu hẹp tìm kiếm tài liệu bằng cách sử dụng bộ lọc",
    "comment_1": "Thiết lập một chỉ mục mà không bao gồm một số định dạng tệp nhất định",
    "comment_2": "Chỉ định thư mục tài liệu",
    "comment_3": "Lấy kết quả tìm kiếm",
    "comment_4": "Xử lý và sử dụng kết quả tìm kiếm"
  }
}