{
  "head": {
    "title": "ค้นหาในเอกสาร {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "{{ProdFullName}} เพิ่มประสิทธิภาพให้กับแอปพลิเคชัน {{ProgLang}} ด้วยการค้นหาข้อความที่มีประสิทธิภาพในรูปแบบเอกสารธุรกิจต่าง ๆ"
  },
  "header": {
    "title": "ค้นหาข้อความในเอกสารธุรกิจ",
    "description": "{{ProdFullName}} ช่วยให้คุณค้นหาข้อความในเอกสารได้อย่างมีประสิทธิภาพและยืดหยุ่น สามารถรวมฟังก์ชันการค้นหาเข้าในแอปพลิเคชัน {{EnvNameShort}} ได้อย่างง่ายดาย",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "{{ProdShortName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีที่มีประสิทธิภาพสำหรับการค้นหาข้อความและการทำดัชนีเอกสารอย่างมีประสิทธิภาพ รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ รวมถึงเอกสารมาตรฐานในอุตสาหกรรม เช่น PDF, Word, Excel และ PowerPoint ปรับปรุงประสิทธิภาพการค้นหาด้วยผลลัพธ์ที่รวดเร็วและแม่นยำ"
  },
  "more_features": {
    "title": "ฟังก์ชันการค้นหาขั้นสูง",
    "description": "{{ProdFullName}} ช่วยให้สามารถค้นหาข้อความที่ซับซ้อนได้ในกว่า 70 รูปแบบไฟล์ การทำดัชนีช่วยเพิ่มประสิทธิภาพในการค้นหาและจัดการเนื้อหาเอกสารได้อย่างมีประสิทธิภาพ",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความขั้นสูง",
      "content": "ดึงข้อมูลข้อความที่เกี่ยวข้องจากเอกสารธุรกิจยอดนิยม รวมถึง PDFs, ไฟล์ Word, งานนำเสนอ และสเปรดชีต รองรับเทคนิคการค้นหาหลายรูปแบบ เช่น การค้นหาหมายเหตุ, การตรวจจับเสียงที่คล้ายกัน และอักขระตัวแทน"
    },
    "feature_2": {
      "title": "การทำดัชนีที่ปรับให้เหมาะสมเพื่อค้นหาที่รวดเร็วขึ้น",
      "content": "สร้างและนำดัชนีการค้นหามาใช้ใหม่เพื่อเพิ่มความเร็วในการค้นหา การทำดัชนีช่วยเพิ่มประสิทธิภาพเมื่อค้นหาผ่านคอลเล็กชันเอกสารขนาดใหญ่"
    },
    "feature_3": {
      "title": "รองรับหลายภาษา",
      "content": "ดำเนินการค้นหาในเอกสารที่เขียนในกว่า 80 ภาษา ตรวจจับรูปแบบคีย์บอร์ดที่แตกต่างกันและความแปรปรวนของคำเพื่อเพิ่มความแม่นยำ"
    },
    "feature_4": {
      "title": "การตั้งค่าการค้นหาที่ยืดหยุ่น",
      "content": "ปรับแต่งผลลัพธ์การค้นหาด้วยตัวเลือกที่กำหนดเอง รวมถึงการกรอง, นิพจน์ปกติ, และการตั้งค่าความไวต่อกรณี"
    }
  },
  "formats": {
    "title": "ค้นหาข้อมูลในเอกสารธุรกิจของคุณ",
    "description": "{{ProdShortName}} รองรับ 70+ รูปแบบไฟล์ ช่วยให้การประมวลผลและค้นหาเอกสารสำนักงานยอดนิยมมีประสิทธิภาพ"
  },
  "operations": {
    "title": "ฟังก์ชันหลัก",
    "description": "ดำเนินการค้นข้อมูลที่แม่นยำและมีประสิทธิภาพ"
  },
  "examples": {
    "comment_1": "เส้นทางในการจัดเก็บดัชนีการค้นหาที่สามารถนำกลับมาใช้ใหม่ได้",
    "comment_2": "โฟลเดอร์ที่มีเอกสาร",
    "comment_3": "ค้นหาเฉพาะในรูปแบบไฟล์ที่กำหนด",
    "comment_4": "เรียกคืนผลลัพธ์การค้นหา"
  },
  "steps": {
    "title": "วิธีการค้นหาข้อมูลในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้การค้นหาข้อความในเอกสาร {{FileFormatUp}} มีประสิทธิภาพ ทำให้เหมาะสำหรับแอปพลิเคชัน {{EnvName}}",
      "step_1": "ตั้งค่าโฟลเดอร์สำหรับจัดเก็บดัชนีการค้นหา",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ของคุณ",
      "step_3": "กำหนดค่าเลือกตัวเลือกการค้นหาเพื่อประมวลผลเฉพาะเอกสาร {{FileFormatUp}}",
      "step_4": "ดำเนินการค้นหาและเรียกคืนผลลัพธ์"
    }
  },
  "code_1": {
    "title": "กรองเอกสารที่จะประมวลผล",
    "content": "เรียนรู้วิธีการจำกัดการค้นหาเอกสารด้วยการกรอง",
    "comment_1": "ตั้งค่าดัชนีที่ไม่รวมรูปแบบไฟล์บางประเภท",
    "comment_2": "ระบุไดเรกทอรีเอกสาร",
    "comment_3": "เรียกคืนผลลัพธ์การค้นหา",
    "comment_4": "ประมวลผลและใช้ผลลัพธ์การค้นหา"
  }
}