{
  "head": {
    "title": "ค้นหาวลีใน {{FileFormatUp}} โดยใช้ {{EnvNameShort}}",
    "description": "{{ProdFullName}} เป็นการเสริมความสามารถให้กับแอปพลิเคชัน {{ProgLang}} ด้วยฟีเจอร์การค้นหาวลีขั้นสูงสำหรับเนื้อหาของเอกสาร."
  },
  "header": {
    "title": "ค้นหาวลีในเอกสาร",
    "description": "ค้นหาวลีที่เฉพาะเจาะจงได้อย่างรวดเร็วด้วย {{ProdFullName}} เพิ่มฟังก์ชันการค้นหาที่ทรงพลังให้กับแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลด"
  },
  "about": {
    "title": "{{ProdShortName}} ฟีเจอร์",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นห้องสมุดที่แข็งแกร่งสำหรับการสร้างดัชนีและค้นหาข้อความภายในเอกสาร รองรับกว่า 70 รูปแบบไฟล์ รวมถึง PDF, เอกสาร Word, แผ่นงาน Excel, รูปภาพ, และไฟล์ ZIP เพื่อให้ผลการค้นหาที่รวดเร็วและแม่นยำ."
  },
  "more_features": {
    "title": "สำรวจเอนจิ้นการค้นหาของเอกสาร {{EnvNameShort}}",
    "description": "{{ProdFullName}} อนุญาตให้ค้นหาวลีในรูปแบบไฟล์กว่า 70 รูปแบบ ค้นหาและจัดระเบียบข้อมูลได้อย่างมีประสิทธิภาพโดยใช้ฟีเจอร์การค้นหาที่ทันสมัย.",
    "image_description": "ความสามารถหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาวลี",
      "content": "สามารถค้นหาวลีที่แน่นอนในเอกสารธุรกิจ เช่น PDF, ไฟล์ Word, งานนำเสนอ และแผ่นงาน ใช้เวิร์ดการ์ดและตัวเลือกอื่นๆ เมื่อไม่ทราบวลีที่แน่นอน."
    },
    "feature_2": {
      "title": "การสร้างดัชนีข้อมูลที่ปรับให้เหมาะสม",
      "content": "เร่งความเร็วในการค้นหาเอกสารโดยการสร้างและนำกลับมาใช้ดัชนีการค้นหา การสร้างดัชนีช่วยจัดระเบียบข้อมูลอย่างมีประสิทธิภาพเพื่อการค้นหาที่รวดเร็วและแม่นยำยิ่งขึ้น."
    },
    "feature_3": {
      "title": "ความเข้ากันได้กับหลายภาษา",
      "content": "ค้นหาเอกสารในกว่า 80 ภาษา รองรับการจัดเรียงแป้นพิมพ์ที่แตกต่างกันและการวิเคราะห์ทางสัณฐานวิทยาเพื่อปรับปรุงความแม่นยำในการค้นหา."
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาที่ทันสมัย",
      "content": "ปรับแต่งการค้นหาด้วยความละเอียดของอักษร การค้นหาที่ไม่แน่นอน การจับคู่เสียงคล้ายกัน การกรองเอกสาร และฟีเจอร์ที่ทรงพลังอื่นๆ."
    }
  },
  "formats": {
    "title": "ค้นหาวลีในเอกสารธุรกิจ",
    "description": "{{ProdShortName}} สนับสนุนการค้นหาวลีในรูปแบบเอกสารกว่า 70 รูปแบบ ใช้ตัวเลือกและการทำดัชนีที่ทันสมัยสำหรับการค้นหาที่มีประสิทธิภาพ."
  },
  "operations": {
    "title": "ความสามารถในการค้นหาขั้นสูง",
    "description": "ใช้ฟังก์ชันการค้นหาล้ำสมัยเพื่อการปรับปรุงความแม่นยำและประสิทธิภาพ."
  },
  "examples": {
    "comment_1": "กำหนดเส้นทางดัชนีการค้นหา",
    "comment_2": "ระบุโฟลเดอร์ที่มีเอกสาร",
    "comment_3": "กำหนดการตั้งค่าการค้นหา",
    "comment_4": "ดำเนินการค้นหาคำถาม"
  },
  "steps": {
    "title": "วิธีการค้นหาวลีในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้การค้นหาวลีในเอกสาร {{FileFormatUp}} ง่ายขึ้น ใช้ตัวเลือกต่างๆ เพื่อปรับปรุงผลการค้นหาในแอปพลิเคชัน {{EnvName}}.",
      "step_1": "สร้างไดเรกทอรีดัชนีการค้นหา.",
      "step_2": "ระบุโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}.",
      "step_3": "ปรับค่าพารามิเตอร์การค้นหา.",
      "step_4": "ดึงและวิเคราะห์ผลการค้นหา."
    }
  },
  "code_1": {
    "title": "การใช้วิธีการค้นหาขั้นสูง",
    "content": "เรียนรู้วิธีการสร้างคำถามสำหรับการค้นหาใน {{FileFormatUp}}.",
    "comment_1": "กำหนดไดเรกทอรีสำหรับดัชนีการค้นหา",
    "comment_2": "กำหนดเส้นทางไปยังเอกสารเป้าหมาย",
    "comment_3": "สร้างคำถามการค้นหาสำหรับวลีเฉพาะ",
    "comment_4": "ดึงผลการค้นหาทั้งหมด",
    "comment_5": "ประมวลผลและใช้ผลลัพธ์ที่ดึงมาได้"
  }
}