{
  "head": {
    "title": "ค้นหาวลีใน {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "{{ProdFullName}} เสริมสร้างแอปพลิเคชัน {{ProgLang}} ด้วยความสามารถในการค้นหาวลีที่ทรงพลังสำหรับเนื้อหาของเอกสาร."
  },
  "header": {
    "title": "ค้นหาวลีในเอกสาร",
    "description": "ค้นหาวลีที่เฉพาะเจาะจงได้อย่างรวดเร็วด้วย {{ProdFullName}} บูรณาการฟังก์ชันการค้นหาที่มีประสิทธิภาพในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลด"
  },
  "about": {
    "title": "{{ProdShortName}} ฟีเจอร์",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นห้องสมุดที่ทรงพลังสำหรับการจัดทำดัชนีและค้นหาข้อความในเอกสาร รองรับกว่า 70 รูปแบบไฟล์ รวมถึง PDF เอกสาร Word แผ่น Excel รูปภาพ และไฟล์ ZIP ทำให้สามารถค้นหาได้อย่างรวดเร็วและแม่นยำ."
  },
  "more_features": {
    "title": "ค้นพบเครื่องมือค้นหาเอกสาร {{EnvNameShort}}",
    "description": "{{ProdFullName}} สามารถทำการค้นหาวลีในกว่า 70 รูปแบบไฟล์ ค้นหาและจัดการข้อมูลได้อย่างมีประสิทธิภาพด้วยความสามารถในการค้นหาขั้นสูง.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาวลี",
      "content": "ค้นหาวลีที่แน่นอนในเอกสารทางธุรกิจ รวมถึง PDF เอกสาร Word งานนำเสนอ และแผ่นงาน ใช้ตัวแทนไวลด์การ์ดและตัวเลือกอื่นๆ หากไม่ทราบวลีที่แน่นอน."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีข้อมูลที่มีประสิทธิภาพ",
      "content": "สร้างและนำกลับมาใช้ดัชนีการค้นหาเพื่อเร่งความเร็วในการค้นหาเอกสาร การจัดทำดัชนีจะจัดระเบียบข้อมูลอย่างมีประสิทธิภาพ ทำให้การค้นหาวลีรวดเร็วยิ่งขึ้น."
    },
    "feature_3": {
      "title": "การสนับสนุนหลายภาษา",
      "content": "ค้นหาเอกสารในกว่า 80 ภาษา รองรับการตั้งค่าคีย์บอร์ดที่แตกต่างกันและรูปแบบทางสัณฐานสำหรับความแม่นยำในการค้นหาที่ดียิ่งขึ้น."
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาที่ยืดหยุ่น",
      "content": "ปรับแต่งการค้นหาด้วยฟีเจอร์ต่างๆ เช่น ความไวต่อการพิมพ์ตัวพิมพ์ใหญ่ ความไม่แม่นยำ และการค้นหาเสียงพ้อง การกรองเอกสาร และอื่นๆ."
    }
  },
  "formats": {
    "title": "การค้นหาวลีในเอกสารทางธุรกิจ",
    "description": "{{ProdShortName}} สนับสนุนการค้นหาใน 70+ รูปแบบเอกสาร ใช้ตัวเลือกขั้นสูงและการจัดทำดัชนีเพื่อลดความซับซ้อนในกระบวนการค้นหาของคุณ."
  },
  "operations": {
    "title": "ฟีเจอร์ขั้นสูง",
    "description": "ใช้ฟังก์ชันการค้นหาที่ยิ่งใหญ่และมีประสิทธิภาพ."
  },
  "examples": {
    "comment_1": "เส้นทางในการจัดเก็บดัชนีการค้นหา",
    "comment_2": "โฟลเดอร์ที่มีเอกสาร",
    "comment_3": "กำหนดค่าตัวเลือกการค้นหา",
    "comment_4": "ดำเนินการค้นหา"
  },
  "steps": {
    "title": "วิธีการค้นหาวลีในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้ง่ายต่อการค้นหาในเอกสาร {{FileFormatUp}} ใช้ตัวเลือกต่างๆ เพื่อลดความไม่แน่นอนของผลลัพธ์การค้นหาในแอปพลิเคชัน {{EnvName}}.",
      "step_1": "ตั้งค่าโฟลเดอร์สำหรับดัชนีการค้นหา.",
      "step_2": "ระบุโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}.",
      "step_3": "กำหนดค่าการตั้งค่าการค้นหา.",
      "step_4": "ดึงและประมวลผลผลลัพธ์การค้นหา."
    }
  },
  "code_1": {
    "title": "การใช้เทคนิคการค้นหาขั้นสูง",
    "content": "เรียนรู้วิธีสร้างคำค้นเพื่อค้นหาใน {{FileFormatUp}}.",
    "comment_1": "ระบุโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ตั้งค่าเส้นทางไปยังเอกสารสำหรับการค้นหา",
    "comment_3": "สร้างคำค้นสำหรับวลีเฉพาะ",
    "comment_4": "ดึงผลลัพธ์การค้นหา",
    "comment_5": "ประมวลผลและนำผลลัพธ์ไปใช้"
  }
}