{
  "head": {
    "title": "ค้นหาวลีใน {{FileFormatUp}} โดยใช้ {{EnvNameShort}}",
    "description": "{{ProdFullName}} เพิ่มฟังก์ชันการค้นหาวลีที่ทรงพลังให้กับแอพพลิเคชัน {{ProgLang}} สำหรับการค้นเอกสารอย่างมีประสิทธิภาพ."
  },
  "header": {
    "title": "ค้นหาวลีในเอกสาร",
    "description": "ค้นหาวลีเฉพาะได้อย่างรวดเร็วด้วย {{ProdFullName}}. บูรณาการความสามารถในการค้นหาที่รวดเร็วและแม่นยำเข้าสู่แอพพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลด"
  },
  "about": {
    "title": "ฟีเจอร์ของ {{ProdShortName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีประสิทธิภาพสูงสำหรับการจัดทำดัชนีและค้นหาข้อความในเอกสาร. รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ รวมถึง PDF, เอกสาร Word, สเปรดชีต Excel, รูปภาพ และ ZIP archives เพื่อให้ผลการค้นหาที่แม่นยำและรวดเร็ว."
  },
  "more_features": {
    "title": "ค้นพบเอนจินค้นหาเอกสาร {{EnvNameShort}}",
    "description": "{{ProdFullName}} ช่วยให้สามารถค้นหาวลีในรูปแบบไฟล์มากกว่า 70 รูปแบบ ทำให้การค้นหาและจัดระเบียบข้อมูลทำได้ง่ายด้วยฟีเจอร์การค้นขั้นสูง.",
    "image_description": "ความสามารถหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาวลี",
      "content": "ค้นหาวลีที่แน่นอนในเอกสารธุรกิจ เช่น PDF, ไฟล์ Word, การนำเสนอ, และสเปรดชีต. ใช้เครื่องหมายแทนและตัวเลือกการค้นหาแบบยืดหยุ่นเมื่อไม่ทราบวลีทั้งหมด."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีข้อมูลที่ปรับแต่งแล้ว",
      "content": "เพิ่มประสิทธิภาพการค้นหาด้วยการสร้างดัชนีที่นำกลับมาใช้ใหม่ได้. การจัดทำดัชนีแบบมีโครงสร้างช่วยเร่งการค้นหาเอกสารและปรับปรุงความแม่นยำ."
    },
    "feature_3": {
      "title": "การรองรับหลายภาษา",
      "content": "ค้นหาเอกสารในภาษามากกว่า 80 ภาษา โดยรองรับการจัดเรียงแป้นพิมพ์ที่แตกต่างกันและรูปแบบคำที่จัดรูปแบบได้ ซึ่งรับประกันผลลัพธ์ที่แม่นยำ."
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาขั้นสูง",
      "content": "กำหนดค่าการค้นหาด้วยความไวต่อขนาด, การจับคู่ใกล้เคียง, การตรวจจับคำพ้อง, การกรองเอกสาร และฟีเจอร์ที่ทรงพลังอื่น ๆ."
    }
  },
  "formats": {
    "title": "ค้นหาวลีในเอกสารธุรกิจ",
    "description": "{{ProdShortName}} สนับสนุนการค้นหาวลีในรูปแบบเอกสารมากกว่า 70 รูปแบบ. ใช้ตัวเลือกขั้นสูงและการจัดทำดัชนีเพื่อทำให้กระบวนการค้นหาเป็นไปอย่างราบรื่น."
  },
  "operations": {
    "title": "ความสามารถในการค้นหาขั้นสูง",
    "description": "ใช้ฟีเจอร์การค้นหาที่ทรงพลังเพื่อผลลัพธ์ที่รวดเร็วยิ่งขึ้นและแม่นยำกว่า."
  },
  "examples": {
    "comment_1": "ระบุเส้นทางในการจัดเก็บดัชนีการค้นหา",
    "comment_2": "ตั้งค่าโฟลเดอร์ที่บรรจุเอกสาร",
    "comment_3": "กำหนดการตั้งค่าการค้นหา",
    "comment_4": "รันคำขอการค้นหา"
  },
  "steps": {
    "title": "วิธีค้นหาวลีในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การค้นหาวลีในเอกสาร {{FileFormatUp}} เป็นเรื่องที่สามารถทำได้ง่าย. ใช้ตัวเลือกการค้นหาต่าง ๆ เพื่อปรับผลลัพธ์ในแอพพลิเคชัน {{EnvName}}.",
      "step_1": "ตั้งค่าธรรมเนียมสำหรับดัชนีการค้นหา.",
      "step_2": "กำหนดโฟลเดอร์ที่บรรจุไฟล์ {{FileFormatUp}}.",
      "step_3": "กำหนดค่าพารามิเตอร์การค้นหา.",
      "step_4": "ดึงและประมวลผลผลการค้นหา."
    }
  },
  "code_1": {
    "title": "การใช้เทคนิคการค้นหาขั้นสูง",
    "content": "เรียนรู้วิธีสร้างคำขอสำหรับการค้นหาใน {{FileFormatUp}}.",
    "comment_1": "กำหนดไดเรกทอรีดัชนีการค้นหา",
    "comment_2": "ตั้งค่าเส้นทางไปยังเอกสารเป้าหมาย",
    "comment_3": "สร้างคำขอสำหรับวลีที่ต้องการ",
    "comment_4": "ดึงผลการค้นหา",
    "comment_5": "ประมวลผลและใช้ผลลัพธ์"
  }
}