{
  "head": {
    "title": "การค้นหา Boolean {{FileFormatUp}} ผ่าน {{EnvNameShort}}",
    "description": "ใช้ API {{ProdFullName}} เพื่อทำการค้นหาขั้นสูงในเนื้อหาของเอกสารด้วยตัวดำเนินการ boolean เช่น AND, OR และ NOT ที่ออกแบบมาสำหรับนักพัฒนา {{ProgLang}}."
  },
  "header": {
    "title": "ดำเนินการค้นหาตามหลักการ Boolean",
    "description": "ด้วย {{ProdFullName}} คุณสามารถสร้างคำค้นหาขั้นสูงโดยใช้ตัวดำเนินการ boolean (AND, OR, NOT) ได้อย่างราบรื่นในสภาพแวดล้อม {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทันที"
  },
  "about": {
    "title": "{{ProdShortName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่ทรงพลังในการค้นหาและจัดทำดัชนีข้อความในเอกสาร รองรับรูปแบบมากกว่า 70 ประเภท เช่น PDF, Word, Excel, PowerPoint, รูปภาพ และไฟล์ ZIP ทำให้สามารถประมวลผลข้อมูลจำนวนมากได้อย่างมีประสิทธิภาพ."
  },
  "more_features": {
    "title": "เครื่องมือที่ทรงพลังสำหรับการค้นหาและจัดทำดัชนีเอกสาร",
    "description": "{{ProdFullName}} ช่วยให้การค้นหาและจัดทำดัชนีข้อความสำหรับไฟล์มากกว่า 70 ประเภท มีความรวดเร็วและแม่นยำในการค้นหาและจัดการข้อมูล.",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาขข้อความที่พัฒนาแล้ว",
      "content": "ค้นหาข้อความได้อย่างรวดเร็วในรูปแบบต่าง ๆ เช่น PDFs, เอกสาร Word, การนำเสนอ และสเปรดชีต ใช้ฟีเจอร์เช่น การจับคู่ที่แม่นยำ, การค้นหาด้วยอักขระแทน, และการค้นหาที่คลาดเคลื่อนเพื่อผลลัพธ์ที่แม่นยำ."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีข้อมูลอย่างมีประสิทธิภาพ",
      "content": "สร้างและจัดการดัชนีเพื่อเพิ่มความเร็วในการค้นหาในคลังเอกสารขนาดใหญ่ การจัดทำดัชนีช่วยให้สามารถเข้าถึงข้อมูลของคุณได้อย่างรวดเร็วและเป็นระเบียบ."
    },
    "feature_3": {
      "title": "การสนับสนุนหลายภาษา",
      "content": "ค้นหาในเอกสารที่เขียนในมากกว่า 80 ภาษา การสนับสนุนทางรูปแบบและความเข้ากันได้ของการจัดเรียงแป้นพิมพ์ช่วยเพิ่มผลลัพธ์การค้นหาในภาษาต่าง ๆ."
    },
    "feature_4": {
      "title": "การตั้งค่าการค้นหาที่มีความยืดหยุ่น",
      "content": "ปรับแต่งการค้นหาของคุณโดยการเปิดใช้งานความไวต่อขนาดตัวอักษร, ใช้ตัวกรองวันที่, หรือข้ามคำและข้อมูลเฉพาะในระหว่างการจัดทำดัชนี."
    }
  },
  "formats": {
    "title": "ค้นหารูปแบบเอกสารยอดนิยม",
    "description": "{{ProdShortName}} รองรับรูปแบบไฟล์มากกว่า 70 ประเภท มีกฎการค้นหาที่ยืดหยุ่นและการจัดทำดัชนีที่มีประสิทธิภาพเพื่อประหยัดเวลาและความพยายาม."
  },
  "operations": {
    "title": "ความสามารถหลักของ {{ProdShortName}}",
    "description": "ปลดล็อคคุณสมบัติการค้นหาขั้นสูงที่มีประสิทธิภาพและสามารถปรับแต่งได้."
  },
  "examples": {
    "comment_1": "กำหนดที่อยู่สำหรับโฟลเดอร์ดัชนี",
    "comment_2": "ระบุโฟลเดอร์ที่มีเอกสารสำหรับการค้นหา",
    "comment_3": "ดำเนินการค้นหาโดยใช้ตรรกะที่ซับซ้อน"
  },
  "steps": {
    "title": "วิธีค้นหาในเอกสาร {{FileFormatUp}} โดยใช้ตัวดำเนินการ boolean",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถค้นหาเนื้อหาในไฟล์ {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ ด้วยตรรกะ boolean คุณสามารถปรับปรุงคำค้นหาของคุณในแอปพลิเคชัน {{EnvName}} เพื่อความแม่นยำที่ดียิ่งขึ้น.",
      "step_1": "ตั้งค่าโฟลเดอร์เพื่อจัดเก็บดัชนีการค้นหา.",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}} สำหรับการค้นหา.",
      "step_3": "ดำเนินการตามคำค้นหาและดึงผลลัพธ์.",
      "step_4": "ประมวลผลและวิเคราะห์ผลลัพธ์การค้นหา."
    }
  },
  "code_1": {
    "title": "ตัวอย่างการค้นหาด้วย boolean ขั้นสูง",
    "content": "ตัวอย่างนี้แสดงวิธีสร้างคำค้นหาที่ใช้ boolean เพื่อค้นหาเนื้อหาในเอกสาร {{FileFormatUp}}.",
    "comment_1": "กำหนดโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ระบุที่อยู่ของเอกสารที่ต้องการค้นหา",
    "comment_3": "สร้างคำค้นหาโดยใช้ตัวดำเนินการ boolean",
    "comment_4": "ดึงผลลัพธ์การค้นหา",
    "comment_5": "ประมวลผลและใช้งานผลลัพธ์การค้นหา"
  }
}