{
  "head": {
    "title": "Tìm kiếm Boolean trong {{FileFormatUp}} với {{ProgLang}}",
    "description": "Với {{ProdFullName}}, các nhà phát triển có thể thực hiện tìm kiếm tài liệu bằng cách sử dụng các toán tử Boolean như AND, OR, và NOT."
  },
  "header": {
    "title": "Tìm kiếm văn bản Boolean",
    "description": "Sử dụng {{ProdFullName}} để tạo các truy vấn tìm kiếm Boolean nâng cao (AND, OR, NOT) trong các dự án {{EnvNameShort}} của bạn.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Tải về miễn phí"
  },
  "about": {
    "title": "Giới thiệu về {{ProdShortName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) là một thư viện đa năng được thiết kế cho việc tìm kiếm văn bản và chỉ mục dữ liệu trong tài liệu. Nó hỗ trợ hơn 70 loại tệp, bao gồm PDF, Word, Excel, PowerPoint, hình ảnh và các tệp ZIP, cho phép tìm kiếm hiệu quả trong những tập dữ liệu lớn."
  },
  "more_features": {
    "title": "Công cụ mạnh mẽ để tìm kiếm và lập chỉ mục tài liệu",
    "description": "{{ProdFullName}} đơn giản hóa việc tìm kiếm văn bản và lập chỉ mục dữ liệu cho hơn 70 định dạng. Nó cung cấp các công cụ tiên tiến cho phép bạn tìm và quản lý nội dung một cách hiệu quả.",
    "image_description": "Các tính năng chính của {{ProdShortName}}",
    "feature_1": {
      "title": "Tìm kiếm văn bản toàn diện",
      "content": "Tìm kiếm qua nhiều định dạng như PDF, tài liệu Word, bản trình bày, bảng tính và nhiều hơn nữa. Sử dụng các tùy chọn như khớp chính xác, tìm kiếm gần đúng và truy vấn ký tự đại diện để cải thiện kết quả."
    },
    "feature_2": {
      "title": "Lập chỉ mục dữ liệu hiệu quả",
      "content": "Xây dựng và duy trì các chỉ mục để tìm kiếm tài liệu nhanh chóng hơn. Tính năng này tổ chức dữ liệu một cách hiệu quả, giúp dễ dàng xử lý các bộ sưu tập tài liệu lớn."
    },
    "feature_3": {
      "title": "Hỗ trợ đa ngôn ngữ",
      "content": "Tìm kiếm trong các tài liệu được viết bằng hơn 80 ngôn ngữ. Tăng cường độ chính xác bằng cách sử dụng các hình thức từ vựng hình thái và các dạng bàn phím khác nhau."
    },
    "feature_4": {
      "title": "Tùy chỉnh tìm kiếm linh hoạt",
      "content": "Điều chỉnh cài đặt tìm kiếm với các tính năng như phân biệt chữ hoa chữ thường, bộ lọc khoảng thời gian và loại trừ để cải thiện kết quả của bạn."
    }
  },
  "formats": {
    "title": "Tìm kiếm các định dạng tài liệu phổ biến",
    "description": "{{ProdShortName}} hỗ trợ hơn 70 định dạng tệp, cho phép bạn tùy chỉnh quy tắc tìm kiếm và sử dụng lập chỉ mục để tối ưu hóa hiệu suất."
  },
  "operations": {
    "title": "Các tính năng chính trong tầm tay",
    "description": "Khám phá các khả năng tìm kiếm mạnh mẽ và hiệu quả"
  },
  "examples": {
    "comment_1": "Đặt đường dẫn cho thư mục chỉ mục",
    "comment_2": "Cung cấp đường dẫn thư mục chứa các tài liệu cho tìm kiếm",
    "comment_3": "Thực hiện tìm kiếm với truy vấn phức tạp"
  },
  "steps": {
    "title": "Cách thực hiện tìm kiếm boolean trong tài liệu {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) cho phép tìm kiếm văn bản trong các tài liệu {{FileFormatUp}}. Với hỗ trợ cho các điều kiện boolean, bạn có thể cải thiện độ chính xác tìm kiếm trong các ứng dụng {{EnvName}}.",
      "step_1": "Chỉ định thư mục để lưu chỉ mục tìm kiếm.",
      "step_2": "Chọn thư mục chứa các tài liệu {{FileFormatUp}}.",
      "step_3": "Thực hiện truy vấn tìm kiếm và lấy kết quả.",
      "step_4": "Xử lý các kết quả thu được."
    }
  },
  "code_1": {
    "title": "Sử dụng các truy vấn tìm kiếm boolean phức tạp",
    "content": "Ví dụ này minh họa cách thực hiện các tìm kiếm Boolean trong các tệp {{FileFormatUp}}.",
    "comment_1": "Đặt thư mục cho chỉ mục tìm kiếm",
    "comment_2": "Cung cấp đường dẫn đến các tài liệu cần tìm kiếm",
    "comment_3": "Xây dựng truy vấn bằng cách sử dụng logic Boolean",
    "comment_4": "Lấy kết quả tìm kiếm",
    "comment_5": "Xử lý các kết quả đã thu được"
  }
}