{
  "head": {
    "title": "การค้นหาทางตรรกะใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ด้วย {{ProdFullName}} นักพัฒนาสามารถดำเนินการค้นหาเอกสารโดยใช้ตัวดำเนินการทางตรรกะเช่น AND, OR และ NOT ได้"
  },
  "header": {
    "title": "การค้นหาข้อความทางตรรกะ",
    "description": "ใช้ {{ProdFullName}} สร้างคำค้นทางตรรกะ (AND, OR, NOT) ขั้นสูงในโครงการ {{EnvNameShort}} ของคุณ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdShortName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีที่หลากหลายออกแบบมาสำหรับการค้นหาข้อความและการจัดดัชนีข้อมูลในเอกสาร รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ รวมถึง PDF, Word, Excel, PowerPoint, รูปภาพ และ ZIP archives ช่วยให้ค้นหาข้อมูลในคลังข้อมูลขนาดใหญ่ได้อย่างมีประสิทธิภาพ"
  },
  "more_features": {
    "title": "เครื่องมือทรงพลังสำหรับการค้นหาและการจัดดัชนีเอกสาร",
    "description": "{{ProdFullName}} ทำให้การค้นหาข้อความและการจัดดัชนีข้อมูลในรูปแบบมากกว่า 70 รูปแบบง่ายขึ้น เครื่องมือขั้นสูงช่วยให้คุณค้นหาและจัดการเนื้อหาได้อย่างมีประสิทธิภาพ",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความที่ครอบคลุม",
      "content": "ค้นหาข้ามรูปแบบหลายอย่างเช่น PDFs, เอกสาร Word, งานนำเสนอ, สเปรดชีต และอื่น ๆ ใช้ตัวเลือกเช่นการจับคู่ที่แน่นอน, การค้นหาที่ไม่แน่นอน, และคำถามที่ใช้ตัวแทนในการปรับแต่งผลลัพท์"
    },
    "feature_2": {
      "title": "การจัดดัชนีข้อมูลที่มีประสิทธิภาพ",
      "content": "สร้างและดูแลดัชนีเพื่อการค้นหาเอกสารที่รวดเร็วขึ้น ฟีเจอร์นี้ช่วยจัดระเบียบข้อมูลอย่างมีประสิทธิภาพ ทำให้จัดการคอลเลคชันเอกสารขนาดใหญ่ได้ง่าย"
    },
    "feature_3": {
      "title": "การสนับสนุนหลายภาษา",
      "content": "ค้นหาในเอกสารที่เขียนด้วยภาษามากกว่า 80 ภาษา เพิ่มความแม่นยำโดยการใช้รูปแบบคำทาง Morphological และรูปแบบแป้นพิมพ์ที่แตกต่างกัน"
    },
    "feature_4": {
      "title": "การปรับแต่งการค้นหาที่ยืดหยุ่น",
      "content": "ปรับการตั้งค่าการค้นหาด้วยฟีเจอร์ต่าง ๆ เช่น การไวต่อการพิมพ์ตัวพิมพ์ใหญ่, การกรองช่วงวันที่, และการยกเว้นเพื่อลดความซับซ้อนของผลลัพธ์"
    }
  },
  "formats": {
    "title": "ค้นหารูปแบบเอกสารที่เป็นที่นิยม",
    "description": "{{ProdShortName}} รองรับรูปแบบไฟล์มากกว่า 70 รูปแบบ ช่วยให้คุณสามารถปรับกฎการค้นหาและใช้การจัดดัชนีเพื่อเพิ่มประสิทธิภาพ"
  },
  "operations": {
    "title": "คุณสมบัติหลักในภาพรวม",
    "description": "เปิดใช้งานความสามารถในการค้นหาที่ทรงพลังและมีประสิทธิภาพ"
  },
  "examples": {
    "comment_1": "กำหนดเส้นทางสำหรับโฟลเดอร์ดัชนี",
    "comment_2": "ระบุเส้นทางของโฟลเดอร์ที่มีเอกสารสำหรับการค้นหา",
    "comment_3": "ดำเนินการค้นหาด้วยคำถามที่ซับซ้อน"
  },
  "steps": {
    "title": "วิธีการดำเนินการค้นหาทางตรรกะในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้ค้นหาข้อความในเอกสาร {{FileFormatUp}} ได้ โดยรองรับเงื่อนไขทางตรรกะ คุณสามารถเพิ่มความแม่นยำในการค้นหาในแอปพลิเคชัน {{EnvName}}",
      "step_1": "ระบุโฟลเดอร์สำหรับจัดเก็บดัชนีการค้นหา",
      "step_2": "เลือกโฟลเดอร์ที่มีเอกสาร {{FileFormatUp}}",
      "step_3": "ดำเนินการค้นหาและดึงผลลัพธ์",
      "step_4": "ประมวลผลผลลัพธ์ที่ได้รับ"
    }
  },
  "code_1": {
    "title": "การใช้คำถามค้นหาทางตรรกะที่ซับซ้อน",
    "content": "ตัวอย่างนี้แสดงวิธีการดำเนินการค้นหาทางตรรกะในไฟล์ {{FileFormatUp}}",
    "comment_1": "กำหนดโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ระบุเส้นทางไปยังเอกสารที่ต้องค้นหา",
    "comment_3": "สร้างคำถามโดยใช้ตรรกะทางตรรกะ",
    "comment_4": "ดึงผลลัพธ์การค้นหา",
    "comment_5": "ประมวลผลผลลัพธ์ที่ดึงมา"
  }
}