{
  "head": {
    "title": "Pesquise {{FileFormatUp}} no {{EnvNameShort}} usando operadores booleanos",
    "description": "A API {{ProdFullName}} permite que desenvolvedores {{ProgLang}} busquem o conteúdo de documentos usando operadores booleanos como AND, OR e NOT."
  },
  "header": {
    "title": "Busca de texto com lógica booleana",
    "description": "{{ProdFullName}} facilita a criação de consultas de busca avançadas usando operadores booleanos (AND, OR, NOT) em suas aplicações {{EnvNameShort}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Baixar Gratuitamente"
  },
  "about": {
    "title": "O que é {{ProdShortName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) é uma biblioteca completa para buscar e indexar texto em documentos. Suporta mais de 70 formatos de arquivo, como PDF, Word, PowerPoint, Excel, imagens e arquivos ZIP, permitindo o processamento eficiente de grandes volumes de informação."
  },
  "more_features": {
    "title": "Explore recursos avançados para busca e indexação de documentos",
    "description": "A biblioteca {{ProdFullName}} simplifica a busca e indexação de texto em mais de 70 formatos de arquivo. Localize e gerencie informações com ferramentas de busca avançadas.",
    "image_description": "Principais recursos do {{ProdShortName}}",
    "feature_1": {
      "title": "Busca de texto poderosa",
      "content": "Pesquise texto em diversos tipos de arquivos, incluindo PDFs, documentos Word, apresentações PowerPoint e planilhas. Utilize recursos como correspondências exatas, buscas difusas e caracteres curinga para refinar os resultados."
    },
    "feature_2": {
      "title": "Indexação de grandes conjuntos de dados",
      "content": "Crie e mantenha índices para pesquisas mais rápidas. A indexação estrutura e organiza os dados, facilitando a busca em grandes coleções de documentos."
    },
    "feature_3": {
      "title": "Suporte a múltiplas línguas",
      "content": "Pesquise documentos em mais de 80 idiomas, com suporte a diferentes layouts de teclado e formas morfológicas de palavras para aumentar a precisão da busca."
    },
    "feature_4": {
      "title": "Opções de busca personalizáveis",
      "content": "Ajuste as configurações de busca com recursos como sensibilidade a maiúsculas, filtros de intervalo de datas e a capacidade de excluir palavras ou dados específicos durante a indexação."
    }
  },
  "formats": {
    "title": "Pesquise em formatos de documentos populares",
    "description": "{{ProdShortName}} suporta mais de 70 formatos de arquivo. Personalize as regras de pesquisa e utilize a indexação para economizar tempo e esforço."
  },
  "operations": {
    "title": "Descubra recursos principais",
    "description": "Explore funcionalidades de busca avançadas e eficientes."
  },
  "examples": {
    "comment_1": "Defina o caminho para a pasta do índice",
    "comment_2": "Especifique a pasta contendo os documentos a serem pesquisados",
    "comment_3": "Execute uma busca usando uma consulta complexa"
  },
  "steps": {
    "title": "Como buscar o conteúdo de documentos {{FileFormatUp}} usando lógica booleana",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) torna a busca pelo conteúdo de documentos {{FileFormatUp}} direta. Ele fornece condições de busca de lógica booleana para refinar os resultados nas aplicações {{EnvName}}.",
      "step_1": "Especifique a pasta para armazenar o índice de busca.",
      "step_2": "Escolha a pasta contendo os arquivos {{FileFormatUp}}.",
      "step_3": "Execute a busca e recupere os resultados.",
      "step_4": "Processar os resultados."
    }
  },
  "code_1": {
    "title": "Usando consultas de busca booleanas avançadas",
    "content": "Este exemplo demonstra como aplicar consultas booleanas para pesquisar documentos {{FileFormatUp}}.",
    "comment_1": "Defina a pasta para o índice de busca",
    "comment_2": "Especifique o caminho para os documentos a serem pesquisados",
    "comment_3": "Crie uma consulta de busca usando lógica booleana",
    "comment_4": "Recupere os resultados da busca",
    "comment_5": "Processar os resultados da busca"
  }
}