{
  "head": {
    "title": "ค้นหาข้อความใน {{FileFormatUp}} ด้วย {{ProdShortName}} ใน {{EnvNameShort}}",
    "description": "ใช้ {{ProdFullName}} ร่วมกับ {{ProgLang}} ในการค้นหาข้อความอย่างมีประสิทธิภาพในรูปแบบเอกสารต่างๆ."
  },
  "header": {
    "title": "โซลูชันการค้นหาเอกสารอัจฉริยะ",
    "description": "ค้นหาข้อความในรูปแบบเอกสารที่หลากหลายด้วย {{ProdFullName}} สร้างคำค้นหาที่ซับซ้อนภายในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ลองใช้งานฟรี"
  },
  "about": {
    "title": "แนะนำเกี่ยวกับ {{ProdShortName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีประสิทธิภาพสูงสำหรับการค้นหาข้อความเต็มรูปแบบและการจัดทำดัชนีเอกสาร รองรับประเภทไฟล์กว่า 70 ประเภท รวมถึง PDF, Word, PowerPoint, Excel, รูปภาพ และไฟล์ ZIP เพื่อให้ได้ผลลัพธ์ที่รวดเร็วและแม่นยำ."
  },
  "more_features": {
    "title": "ความสามารถในการค้นหาและจัดทำดัชนีขั้นสูง",
    "description": "{{ProdFullName}} ให้เครื่องมือค้นหาและจัดทำดัชนีที่ทรงพลังสำหรับเอกสารกว่า 70 รูปแบบ ทำให้ค้นหาและจัดระเบียบข้อมูลได้ง่าย.",
    "image_description": "ประโยชน์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ค้นหาข้อความอย่างครอบคลุม",
      "content": "ค้นหาข้อความในเอกสารประเภทต่างๆ รวมถึง PDF, เอกสาร Word, งานนำเสนอ PowerPoint และสเปรดชีต ใช้การจับคู่ที่แน่นอน การค้นหาแบบเบลอ และอักขระพิเศษสำหรับผลลัพธ์ที่แม่นยำ."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีที่มีประสิทธิภาพสำหรับข้อมูลขนาดใหญ่",
      "content": "เพิ่มความเร็วในการค้นหาด้วยการสร้างดัชนีที่มีโครงสร้าง ทำให้การดึงข้อมูลจากคอลเล็กชันเอกสารขนาดใหญ่เป็นไปได้ง่าย."
    },
    "feature_3": {
      "title": "รองรับ 80+ ภาษา",
      "content": "ค้นหาในเอกสารที่แตกต่างกันในหลายภาษา พร้อมการรู้จำอัตโนมัติของรูปแบบคำต่าง ๆ และรูปแบบแป้นพิมพ์."
    },
    "feature_4": {
      "title": "การตั้งค่าการค้นหาที่กำหนดเอง",
      "content": "ปรับแต่งตัวเลือกการค้นหา เช่น ความไวต่อพิมพ์ใหญ่พิมพ์เล็ก ตัวกรองวันที่ และคำที่ไม่รวม เพื่อให้ได้ผลลัพธ์ที่แม่นยำ."
    }
  },
  "formats": {
    "title": "ค้นหาในเอกสารหลากหลาย",
    "description": "{{ProdShortName}} ทำงานร่วมกับไฟล์กว่า 70 รูปแบบ รวมถึงเอกสารสำนักงาน เพื่อให้การค้นหาที่รวดเร็วและแม่นยำพร้อมการสนับสนุนการจัดทำดัชนี."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลัก",
    "description": "ค้นพบฟีเจอร์ค้นหาที่มีความเร็วสูงออกแบบมาเพื่อเพิ่มประสิทธิภาพและความแม่นยำ."
  },
  "examples": {
    "comment_1": "กำหนดไดเรกทอรีสำหรับการจัดเก็บดัชนีการค้นหา",
    "comment_2": "เลือกโฟลเดอร์ที่มีเอกสารสำหรับการค้นหา",
    "comment_3": "เปิดใช้งานการค้นหาคำเหมือนที่ฟังดูคล้ายกัน",
    "comment_4": "ดำเนินการค้นหาที่ซับซ้อน"
  },
  "steps": {
    "title": "ดำเนินการค้นหาในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถดำเนินการค้นหาในไฟล์ {{FileFormatUp}} โดยการปรับผลลัพธ์ในแอปพลิเคชัน {{EnvName}}.",
      "step_1": "กำหนดโฟลเดอร์สำหรับการจัดเก็บดัชนีการค้นหา.",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}.",
      "step_3": "ตั้งค่าพารามิเตอร์การค้นหาเพิ่มเติม.",
      "step_4": "ดำเนินการค้นหาและวิเคราะห์ผลลัพธ์."
    }
  },
  "code_1": {
    "title": "การใช้การค้นหาสำหรับเอกสาร {{FileFormatUp}}",
    "content": "ตัวอย่างนี้แสดงวิธีการใช้คำค้นหาในเอกสาร {{FileFormatUp}}.",
    "comment_1": "ตั้งค่าไดเรกทอรีสำหรับการจัดทำดัชนีการค้นหา",
    "comment_2": "ระบุที่อยู่ไฟล์สำหรับการจัดเก็บเอกสาร",
    "comment_3": "ป้อนรหัสผ่านสำหรับไฟล์ที่ปกป้อง",
    "comment_4": "เปิดใช้งานการค้นหาคำที่ฟังดูคล้ายกัน",
    "comment_5": "ดึงผลลัพธ์การค้นหา",
    "comment_6": "ประมวลผลและตรวจสอบผลลัพธ์"
  }
}