{
  "head": {
    "title": "ค้นหาเอกสาร {{FileFormatUp}} ใน {{EnvNameShort}} ด้วย {{ProdShortName}}",
    "description": "ใช้ {{ProdFullName}} เพื่อทำการค้นหาข้อความที่มีประสิทธิภาพในรูปแบบเอกสารต่างๆ โดยใช้ {{ProgLang}}."
  },
  "header": {
    "title": "การค้นหาข้อความในเอกสารขั้นสูง",
    "description": "{{ProdFullName}} ทำให้การค้นหาข้อความในรูปแบบเอกสารยอดนิยมง่ายขึ้น ช่วยให้คุณสร้างการค้นหาที่ทรงพลังในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "{{ProdShortName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นห้องสมุดที่ทรงพลังสำหรับการค้นหาและจัดทำดัชนีข้อความในเอกสาร รองรับไฟล์กว่า 70 รูปแบบ รวมถึง PDF, Word, PowerPoint, Excel, รูปภาพ และไฟล์ ZIP เพื่อให้ผลลัพธ์การค้นหาที่รวดเร็วและแม่นยำ."
  },
  "more_features": {
    "title": "ฟีเจอร์การค้นหาและการจัดทำดัชนีที่ล้ำสมัย",
    "description": "{{ProdFullName}} เพิ่มประสิทธิภาพการค้นหาและการจัดทำดัชนีในรูปแบบเอกสารกว่า 70 รูปแบบ มอบเครื่องมือที่มีประสิทธิภาพในการค้นหาและจัดการข้อมูล.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความที่ทรงพลัง",
      "content": "ค้นหาข้อความในหลายประเภทเอกสาร รวมถึง PDF, เอกสาร Word, งานนำเสนอ PowerPoint และสเปรดชีต ใช้ฟีเจอร์เช่นการค้นหาแบบตรง, การค้นหาที่คลุมเครือ และอักขระแทนเพื่อปรับปรุงผลลัพธ์ของคุณ."
    },
    "feature_2": {
      "title": "การจัดทำดัชนีที่รวดเร็วสำหรับชุดข้อมูลขนาดใหญ่",
      "content": "สร้างและจัดการดัชนีการค้นหาสำหรับการดึงข้อมูลอย่างรวดเร็ว การจัดทำดัชนีช่วยเพิ่มประสิทธิภาพการค้นหาในคอลเลกชันเอกสารขนาดใหญ่."
    },
    "feature_3": {
      "title": "การสนับสนุนหลายภาษา",
      "content": "ทำการค้นหาในมากกว่า 80 ภาษา โดยรองรับรูปแบบคีย์บอร์ดที่แตกต่างกันและรูปแบบคำที่แตกต่างกันเพื่อปรับปรุงความแม่นยำ."
    },
    "feature_4": {
      "title": "การตั้งค่าการค้นหาที่ปรับแต่งได้",
      "content": "ปรับแต่งพารามิเตอร์การค้นหาด้วยตัวเลือก เช่น ความไวต่อพิมพ์ใหญ่พิมพ์เล็ก, ตัวกรองช่วงวัน และการตัดคำเพื่อผลลัพธ์ที่ดีกว่า."
    }
  },
  "formats": {
    "title": "ค้นหาผ่านเอกสารทางธุรกิจของคุณ",
    "description": "{{ProdShortName}} รองรับรูปแบบเอกสารมากกว่า 70 รูปแบบ รวมถึงเอกสารสำนักงาน เพื่อให้การค้นหาที่รวดเร็วและมีประสิทธิภาพพร้อมความสามารถในการจัดทำดัชนี."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลัก",
    "description": "ใช้ประโยชน์จากฟังก์ชันการค้นหาที่ล้ำสมัยและมีประสิทธิภาพสูง."
  },
  "examples": {
    "comment_1": "กำหนดเส้นทางสำหรับดัชนีการค้นหา",
    "comment_2": "เลือกโฟลเดอร์ที่มีเอกสารที่จะค้นหา",
    "comment_3": "เปิดใช้งานการค้นหาคำพ้องเสียงเพื่อค้นหาคำที่มีเสียงเหมือนกัน",
    "comment_4": "ดำเนินการค้นหาที่ซับซ้อน"
  },
  "steps": {
    "title": "วิธีการค้นหาข้อความในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้สามารถดำเนินการค้นหาขั้นสูงในเอกสาร {{FileFormatUp}} ได้ โดยช่วยให้ได้ผลลัพธ์การค้นหาที่ปรับปรุงในแอปพลิเคชัน {{EnvName}}.",
      "step_1": "ตั้งค่าโฟลเดอร์สำหรับจัดเก็บดัชนีการค้นหา.",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}.",
      "step_3": "กำหนดค่าตัวเลือกการค้นหาเพิ่มเติม.",
      "step_4": "เรียกใช้การค้นหาและตรวจสอบผลลัพธ์."
    }
  },
  "code_1": {
    "title": "การดำเนินการค้นหาที่ซับซ้อน",
    "content": "ตัวอย่างนี้แสดงวิธีการใช้คำค้นสำหรับเอกสาร {{FileFormatUp}}.",
    "comment_1": "กำหนดโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ระบุเส้นทางไปยังไฟล์เอกสาร",
    "comment_3": "กำหนดรหัสผ่านสำหรับเอกสารที่ป้องกัน",
    "comment_4": "เปิดใช้งานการค้นหาคลุมเครือเพื่อค้นหาคำที่คล้ายกัน",
    "comment_5": "ดึงผลลัพธ์การค้นหา",
    "comment_6": "ประมวลผลเอาต์พุตการค้นหา"
  }
}