{
  "head": {
    "title": "การค้นหาที่ไวต่อการพิมพ์ใน {{FileFormatUp}} โดยใช้ {{EnvNameShort}}",
    "description": "API ของ {{ProdFullName}} ช่วยให้นักพัฒนา {{ProgLang}} สามารถทำการค้นหาที่ไวต่อการพิมพ์ในเอกสารต่างๆ ได้."
  },
  "header": {
    "title": "การค้นหาที่ไวต่อการพิมพ์",
    "description": "{{ProdFullName}} ช่วยให้คุณสร้างคำค้นหาที่ไวต่อการพิมพ์ในแอปพลิเคชัน {{EnvNameShort}} ของคุณได้.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "{{ProdShortName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นห้องสมุดที่มีประสิทธิภาพสำหรับการค้นหาและการทำดัชนีข้อความในเอกสาร รองรับมากกว่า 70 รูปแบบไฟล์ รวมถึง PDF, Word, PowerPoint, Excel, รูปภาพ และไฟล์ ZIP เพื่อให้การจัดการข้อมูลขนาดใหญ่มีประสิทธิภาพ."
  },
  "more_features": {
    "title": "ฟีเจอร์ขั้นสูงสำหรับการค้นหาและการทำดัชนีเอกสาร",
    "description": "ห้องสมุด {{ProdFullName}} ช่วยให้การค้นหาและการทำดัชนีข้อความในรูปแบบไฟล์มากกว่า 70 รูปแบบเป็นไปอย่างง่ายดาย สามารถค้นหาและจัดการข้อมูลด้วยเครื่องมือค้นหาที่ทรงพลัง.",
    "image_description": "ฟีเจอร์สำคัญของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความขั้นสูง",
      "content": "ค้นหาข้อความในรูปแบบไฟล์ต่างๆ รวมถึง PDF, เอกสาร Word, สเปรดชีต และนำเสนอ โดยใช้ตัวเลือกเช่น การจับคู่ที่แน่นอน, การค้นหาแบบ fuzzy และอักขระแทนสำหรับผลลัพธ์ที่แม่นยำ."
    },
    "feature_2": {
      "title": "ทำดัชนีชุดข้อมูลขนาดใหญ่",
      "content": "สร้างและดูแลดัชนีเพื่อการค้นหาที่รวดเร็ว การจัดระเบียบดัชนีช่วยให้การค้นหาชุดเอกสารขนาดใหญ่เป็นไปอย่างมีประสิทธิภาพ."
    },
    "feature_3": {
      "title": "รองรับหลายภาษา",
      "content": "ค้นหาในเอกสารได้กว่า 80 ภาษา โดยมีการรองรับเลย์เอาต์แป้นพิมพ์และรูปแบบคำที่แตกต่างกันเพื่อผลลัพธ์ที่แม่นยำยิ่งขึ้น."
    },
    "feature_4": {
      "title": "ตัวเลือกการค้นหาที่ปรับแต่งได้",
      "content": "ปรับแต่งการตั้งค่าการค้นหาด้วยความไวต่อการพิมพ์, ตัวกรองช่วงวันที่ และความสามารถในการละเว้นคำหรือข้อมูลเฉพาะระหว่างการทำดัชนี."
    }
  },
  "formats": {
    "title": "ค้นหารูปแบบเอกสารที่เป็นที่นิยม",
    "description": "{{ProdShortName}} รองรับมากกว่า 70 รูปแบบไฟล์ ปรับแต่งกฎการค้นหาและใช้การทำดัชนีเพื่อลดเวลาและความพยายาม."
  },
  "operations": {
    "title": "ค้นพบฟีเจอร์สำคัญ",
    "description": "สำรวจฟังก์ชันการค้นหาที่มีประสิทธิภาพและขั้นสูง."
  },
  "examples": {
    "comment_1": "กำหนดเส้นทางไปยังโฟลเดอร์ดัชนี",
    "comment_2": "ระบุโฟลเดอร์ที่มีเอกสารที่จะค้นหา",
    "comment_3": "เปิดใช้งานการค้นหาที่ไวต่อการพิมพ์ในตัวเลือก",
    "comment_4": "ดำเนินการค้นหา"
  },
  "steps": {
    "title": "วิธีการค้นหาที่ไวต่อการพิมพ์ในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้การค้นหาที่ไวต่อการพิมพ์ในเอกสาร {{FileFormatUp}} เป็นไปอย่างราบรื่น ใช้เพื่อปรับผลลัพธ์ในแอปพลิเคชัน {{EnvName}}.",
      "step_1": "กำหนดโฟลเดอร์สำหรับจัดเก็บดัชนีการค้นหา.",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}.",
      "step_3": "ดำเนินการค้นหาและเรียกดูผลลัพธ์.",
      "step_4": "ประมวลผลผลลัพธ์."
    }
  },
  "code_1": {
    "title": "ใช้คำค้นหาที่ไวต่อการพิมพ์",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงการใช้คำค้นหาที่ไวต่อการพิมพ์ในการค้นหาเอกสาร {{FileFormatUp}}.",
    "comment_1": "กำหนดโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ระบุเส้นทางไปยังเอกสารที่ต้องค้นหา",
    "comment_3": "สร้างคำค้นหาขึ้นมา",
    "comment_4": "เปิดใช้งานตัวเลือกการค้นหาที่ไวต่อการพิมพ์",
    "comment_5": "ค้นหาข้อความในเอกสาร",
    "comment_6": "ประมวลผลผลลัพธ์การค้นหา"
  }
}