{
  "head": {
    "title": "ดำเนินการค้นหาแบบแยกตัวพิมพ์ใน {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "API {{ProdFullName}} ช่วยให้นักพัฒนา {{ProgLang}} สามารถดำเนินการค้นหาแบบแยกตัวพิมพ์ในเอกสารหลายประเภทได้"
  },
  "header": {
    "title": "การค้นเอกสารแบบแยกตัวพิมพ์",
    "description": "{{ProdFullName}} ช่วยให้คุณสามารถ Implement ฟังก์ชันการค้นหาแบบแยกตัวพิมพ์ในโปรเจค {{EnvNameShort}} ของคุณได้",
    "subtitle": "{{ProdFullName}}",
    "action_title": "รับฟรี"
  },
  "about": {
    "title": "เรียนรู้เกี่ยวกับ {{ProdShortName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่หลากหลายสำหรับการค้นหาและจัดทำดัชนีข้อความในเอกสารต่างๆ รองรับกว่า 70 รูปแบบรวมถึง PDFs, เอกสาร Word, งานนำเสนอ PowerPoint, แผ่น Excel, รูปภาพ และ ZIPs ซึ่งช่วยให้คุณจัดการกับชุดข้อมูลขนาดใหญ่ได้อย่างมีประสิทธิภาพ"
  },
  "more_features": {
    "title": "เครื่องมือค้นหาและจัดทำดัชนีที่พัฒนาแล้ว",
    "description": "ด้วย {{ProdFullName}} คุณสามารถปรับปรุงการค้นหาและการจัดทำดัชนีเอกสารสำหรับรูปแบบกว่า 70 รูปแบบ ทำให้ค้นหาข้อมูลและจัดระเบียบข้อมูลได้ง่ายขึ้น",
    "image_description": "จุดเด่นของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อความที่ยืดหยุ่น",
      "content": "ค้นหาผ่านเอกสารต่างๆ เช่น PDFs, เอกสาร Word, สเปรดชีต และงานนำเสนอ โดยใช้เครื่องมือต่างๆ เช่น การจับคู่แบบระบุ, การค้นหาที่ไม่ชัดเจน และการสนับสนุนอักขระตัวพิมพ์แทนเพื่อปรับผลลัพธ์ของคุณ"
    },
    "feature_2": {
      "title": "การจัดการดัชนีที่มีประสิทธิภาพ",
      "content": "จัดระเบียบและทำดัชนีชุดข้อมูลขนาดใหญ่เพื่อปรับปรุงความเร็วและประสิทธิภาพในการค้นหาเมื่อจัดการกับคอลเลกชันเอกสารขนาดใหญ่"
    },
    "feature_3": {
      "title": "รองรับภาษาโลก",
      "content": "ดำเนินการค้นหาในกว่า 80 ภาษา รองรับแป้นพิมพ์และความแตกต่างทางภาษาเพื่อความแม่นยำที่ดียิ่งขึ้น"
    },
    "feature_4": {
      "title": "ตัวกรองการค้นหาที่ปรับแต่งได้",
      "content": "ปรับเกณฑ์การค้นหาด้วยตัวเลือกต่างๆ เช่น ความไวต่อการพิมพ์, การกรองช่วงวันที่ และการยกเว้นคำหรือข้อมูลที่ไม่ต้องการในระหว่างการจัดทำดัชนี"
    }
  },
  "formats": {
    "title": "รูปแบบไฟล์ที่รองรับสำหรับการค้นหา",
    "description": "{{ProdShortName}} ทำงานร่วมกับรูปแบบเอกสารยอดนิยมกว่า 70 รูปแบบ เสนอการตั้งค่าการค้นหาที่ปรับแต่งได้และการจัดทำดัชนีที่มีประสิทธิภาพ"
  },
  "operations": {
    "title": "ภาพรวมฟีเจอร์ที่สำคัญ",
    "description": "ค้นพบความสามารถในการค้นหาที่แข็งแกร่งและมีประสิทธิภาพที่นำเสนอโดย {{ProdFullName}}"
  },
  "examples": {
    "comment_1": "กำหนดตำแหน่งสำหรับการจัดเก็บดัชนี",
    "comment_2": "ชี้ไปที่โฟลเดอร์ที่มีเอกสารที่จะค้นหา",
    "comment_3": "เปิดใช้งานโหมดการแยกตัวพิมพ์ในการตั้งค่าการค้นหา",
    "comment_4": "ดำเนินการค้นหา"
  },
  "steps": {
    "title": "คู่มือการค้นหาแบบแยกตัวพิมพ์ในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "ด้วย [{{ProdShortName}}]({{PlatformLink}}) คุณสามารถดำเนินการค้นหาแบบแยกตัวพิมพ์ในเอกสาร {{FileFormatUp}} ได้ ซึ่งช่วยเสริมโปรเจค {{EnvName}} ของคุณ",
      "step_1": "กำหนดโฟลเดอร์สำหรับการจัดเก็บดัชนีการค้นหา",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}",
      "step_3": "ดำเนินการค้นหาที่แยกตัวพิมพ์และเก็บผลลัพธ์",
      "step_4": "ประมวลผลและใช้ผลลัพธ์การค้นหา"
    }
  },
  "code_1": {
    "title": "ตัวอย่าง: คำค้นหาที่แยกตัวพิมพ์",
    "content": "ตัวอย่างนี้แสดงวิธีการดำเนินการค้นหาแบบแยกตัวพิมพ์สำหรับเอกสาร {{FileFormatUp}}",
    "comment_1": "กำหนดไดเร็กทอรีสำหรับดัชนีการค้นหา",
    "comment_2": "กำหนดตำแหน่งของโฟลเดอร์เอกสาร",
    "comment_3": "ตั้งค่าคำค้นหา",
    "comment_4": "เปิดใช้งานความไวต่อกรณีในตัวเลือกการค้นหา",
    "comment_5": "ดำเนินการค้นหาเอกสาร",
    "comment_6": "ประมวลผลผลลัพธ์ที่ดึงมา"
  }
}