{
  "head": {
    "title": "ค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ใน {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "API {{ProdFullName}} ช่วยให้นักพัฒนาที่ใช้ {{ProgLang}} สามารถดำเนินการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ในประเภทเอกสารต่างๆ ได้"
  },
  "header": {
    "title": "การค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่",
    "description": "{{ProdFullName}} ช่วยให้คุณสามารถนำฟังก์ชันการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ไปใช้ในแอปพลิเคชัน {{EnvNameShort}} ของคุณ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "คืออะไร {{ProdShortName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นไลบรารีที่มีพลังสำหรับการค้นหาและสร้างดัชนีข้อความในเอกสาร รองรับรูปแบบมากกว่า 70 รูปแบบ รวมถึง PDF, Word, Excel, PowerPoint, รูปภาพ และไฟล์ ZIP ทำให้จัดการข้อมูลจำนวนมากได้อย่างมีประสิทธิภาพ"
  },
  "more_features": {
    "title": "ฟีเจอร์สำคัญสำหรับการค้นหาและสร้างดัชนีเอกสาร",
    "description": "ด้วย {{ProdFullName}} คุณสามารถค้นหาและสร้างดัชนีข้อความในรูปแบบไฟล์มากกว่า 70 รูปแบบได้อย่างมีประสิทธิภาพ จัดระเบียบข้อมูลได้อย่างง่ายดายด้วยเครื่องมือการค้นหาขั้นสูง",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การค้นหาข้อมูลแบบครบวงจร",
      "content": "ค้นหาข้อความในประเภทเอกสารต่างๆ เช่น PDF, ไฟล์ Word, สเปรดชีต และนำเสนอ ใช้ตัวเลือกเช่น การจับคู่ที่แน่นอน การค้นหาที่คลุมเครือ และอักขระพิเศษเพื่อผลลัพธ์ที่แม่นยำ"
    },
    "feature_2": {
      "title": "การสร้างดัชนีข้อมูลอย่างมีประสิทธิภาพ",
      "content": "สร้างและจัดการดัชนีเพื่อเร่งความเร็วในการค้นหา การสร้างดัชนีช่วยให้คุณจัดระเบียบและค้นหาข้อมูลในคอลเลกชันเอกสารขนาดใหญ่ได้อย่างรวดเร็ว"
    },
    "feature_3": {
      "title": "รองรับหลายภาษา",
      "content": "ค้นหาเอกสารในกว่า 80 ภาษา รองรับรูปแบบแป้นพิมพ์ที่หลากหลายและความแปรปรวนของคำ เพื่อให้ผลการค้นหาที่แม่นยำ"
    },
    "feature_4": {
      "title": "การตั้งค่าการค้นหาที่ปรับแต่งได้",
      "content": "ปรับการตั้งค่าการค้นหา รวมถึงความไวต่อพิมพ์ใหญ่ ตัวกรองวันที่ และการยกเว้นคำหรือข้อมูลเฉพาะระหว่างการสร้างดัชนี"
    }
  },
  "formats": {
    "title": "รูปแบบเอกสารที่รองรับ",
    "description": "{{ProdShortName}} รองรับรูปแบบเอกสารมากกว่า 70 รูปแบบ ปรับแต่งตัวเลือกการค้นหาของคุณและประหยัดเวลาในการจัดทำดัชนี"
  },
  "operations": {
    "title": "ฟังก์ชันหลัก",
    "description": "สำรวจฟีเจอร์ขั้นสูงสำหรับการค้นหาเอกสารอย่างรวดเร็วและแม่นยำ"
  },
  "examples": {
    "comment_1": "ระบุเส้นทางสำหรับโฟลเดอร์ดัชนี",
    "comment_2": "ตั้งค่าโฟลเดอร์ที่มีเอกสารสำหรับการค้นหา",
    "comment_3": "เปิดใช้งานการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ในการตั้งค่า",
    "comment_4": "ดำเนินการค้นหา"
  },
  "steps": {
    "title": "ขั้นตอนในการดำเนินการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถดำเนินการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่ในไฟล์ {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ ช่วยเพิ่มเวิร์กโฟลว์ใน {{EnvName}} ของคุณ",
      "step_1": "ตั้งค่าโฟลเดอร์เพื่อจัดเก็บดัชนีการค้นหา",
      "step_2": "เลือกโฟลเดอร์ที่มีไฟล์ {{FileFormatUp}}",
      "step_3": "ดำเนินการค้นหาและรับผลลัพธ์",
      "step_4": "ประมวลผลและใช้ผลลัพธ์"
    }
  },
  "code_1": {
    "title": "ตัวอย่าง: การดำเนินการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงวิธีการดำเนินการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่สำหรับเอกสาร {{FileFormatUp}}",
    "comment_1": "กำหนดโฟลเดอร์สำหรับดัชนีการค้นหา",
    "comment_2": "ระบุเส้นทางไปยังโฟลเดอร์เอกสาร",
    "comment_3": "ตั้งค่าคำค้นหาสำหรับการค้นหา",
    "comment_4": "เปิดใช้งานการตั้งค่าการค้นหาที่คำนึงถึงความเป็นพิมพ์ใหญ่",
    "comment_5": "ค้นหาข้อความในเอกสาร",
    "comment_6": "ประมวลผลและจัดการผลลัพธ์"
  }
}